/**
 * 用户名正则表达式
 * 2-16位数字、字母、下划线或中划线
 */
export const REG_USER_NAME = /^[\u4E00-\u9FA5a-zA-Z0-9_-]{2,16}$/
/**
 * 用户昵称正则表达式
 * 2-16位数字、字母或中划线
 */
export const REG_NICK_NAME = /^[\u4E00-\u9FA5\d]{2,16}$/

/**
 * 密码正则表达式
 * 6-18位数字、字母或下划线
 */
export const REG_PWD = /^\w{6,18}$/

/**
 * 邮箱正则表达式
 */
export const REG_EMAIL = /^\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$/

/**
 * 手机号正则表达式
 */
export const REG_PHONE =
	/^[1](([3][0-9])|([4][01456789])|([5][012356789])|([6][2567])|([7][0-8])|([8][0-9])|([9][012356789]))[0-9]{8}$/
